#include "menu.h"
#include <stdio.h>
#include <stdlib.h>
/****************************************************************************
*函数名：menu
*功能：打印文件功能菜单
*变量：ch 记录选项
****************************************************************************/
int menu() {
	int ch;					//选项
	system("cls");
	printf("学生信息管理系统\n");
	printf("---------------------------------\n");
	printf("1、学生信息录入\n");		//按学期、班级完成对学生成绩的录入
	printf("2、学生信息输出\n");		//按班级输出学生的成绩单
	printf("3、学生成绩信息情况查询\n");	//查询学生成绩和不及格科目及学生名单
	printf("4、学生成绩信息修改\n");	//按学期、按班级完成对学生成绩信息的修改
	printf("5、学生成绩计算统计\n");	//按班级统计学生的成绩，求学生的总分及平均分
	printf("0、退出系统\n");
	printf("---------------------------------\n");
	printf("请输入你的选项\n");
	fflush(stdin);
	scanf_s("%d", &ch);
	return ch;
}